# UsedInSizing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSize..::..UsedInSizing Property
MEPSize Class See Also
---
Whether is used in sizing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool UsedInSizing { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UsedInSizing As Boolean
	Get
```

Visual C++
---
```text
public:
property bool UsedInSizing {
	bool get ();
}
```

# See Also
MEPSize Class
Autodesk.Revit.DB Namespace